STMicroelectronics/STM32CubeG4/Projects/STM32G474E-EVAL/Demonstrations/Modules/ucpd/usbpd_dpm_user.c
/**
  ******************************************************************************
  * @file    usbpd_dpm_user.c
  * @author  MCD Application Team
  * @brief   USBPD DPM user code
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2018 STMicroelectronics International N.V.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

#define USBPD_DPM_USER_C
/* Includes ------------------------------------------------------------------*/
#include "stm32g4xx_hal.h"
#include "usbpd_core.h"
#include "usbpd_dpm_core.h"
#include "usbpd_dpm_conf.h"
#include "usbpd_dpm_user.h"
#include "usbpd_pwr_if.h"
#if defined(_GUI_INTERFACE) || defined(_TRACE)
#include "usbpd_trace.h"
#if defined(_GUI_INTERFACE)
#include "gui_api.h"
#endif
#endif /* _GUI_INTERFACE || _TRACE */
#if defined(USBPD_REV30_SUPPORT) && _ALERT
#include "usbpd_hw_if.h"
#endif /* USBPD_REV30_SUPPORT && _ALERT */

#if defined(_VDM) || defined (_VCONN_SUPPORT)
#include "usbpd_vdm_user.h"
#endif /*_VDM*/
#include "string.h"
#if defined(USBPD_BILLBOARD)
#include "usbd_core.h"
#include "usbd_desc.h"
#include "usbd_bb.h"
#endif /* USBPD_BILLBOARD */
#ifdef _RTOS
#include "cmsis_os.h"
#else
#include "stm32g4xx.h"
#endif
#include "demo_application.h"
#if defined(_FWUPDATE_RESPONDER)||defined(_FWUPDATE_INITIATOR)
#if defined(_FWUPDATE_INITIATOR)
#include "usbpd_pdfu_initiator.h"
#endif /* _FWUPDATE_INITIATOR */
#if defined(_FWUPDATE_RESPONDER)
#include "usbpd_pdfu_responder.h"
#endif /* _FWUPDATE_RESPONDER */
#include "usbpd_pdfu_user.h"
#endif /* _FWUPDATE_RESPONDER)|| _FWUPDATE_INITIATOR */

/** @addtogroup STM32_USBPD_LIBRARY
  * @{
  */

/** @addtogroup USBPD_USER
  * @{
  */

/* Private typedef -----------------------------------------------------------*/
#if defined(_SNK) || defined(_DRP)
/** @brief  Sink Request characteritics Structure definition
  *
  */
typedef struct
{
  uint32_t RequestedVoltageInmVunits;              /*!< Sink request operating voltage in mV units       */
  uint32_t MaxOperatingCurrentInmAunits;           /*!< Sink request Max operating current in mA units   */
  uint32_t OperatingCurrentInmAunits;              /*!< Sink request operating current in mA units       */
  uint32_t MaxOperatingPowerInmWunits;             /*!< Sink request Max operating power in mW units     */
  uint32_t OperatingPowerInmWunits;                /*!< Sink request operating power in mW units         */
} USBPD_DPM_SNKPowerRequestDetails_TypeDef;
#endif /*_SNK || _DRP */

/* Private define ------------------------------------------------------------*/
/** @defgroup USBPD_USER_PRIVATE_DEFINES USBPD USER Private Defines
  * @{
  */

#define DPM_TIMER_ENABLE_MSK      ((uint16_t)0x8000U)       /*!< Enable Timer Mask                                                        */
#define DPM_TIMER_READ_MSK        ((uint16_t)0x7FFFU)       /*!< Read Timer Mask                                                          */

#define DPM_BOX_MESSAGES_MAX      30u
#if defined(USBPD_BILLBOARD)

/* Timer used to start billboard driver (based on tAMETimeout */
#define DPM_TIMER_AME             1000u  /*!< 1000ms: The time between a Sink attach until a
                                                USB Billboard Device Class interface is
                                                exposed when an Alternate Mode is
                                                not successfully entered*/
#endif /* USBPD_BILLBOARD */
#if _SRC_CAPA_EXT

/* Timer used to send a GET_SRC_CAPA_EXT*/
#define DPM_TIMER_GET_SRC_CAPA_EXT  300u  /*!< 300ms */
#endif /* GENERATOR_SRC_CAPA_EXT_SUPPORT_YES */
#if _ALERT

/* Timer used to check if need to send an alert */
#define DPM_TIMER_ALERT             100u  /*!< 100ms */
#endif /* GENERATOR_ALERT_SUPPORT_YES */

#define DPM_NO_SRC_PDO_FOUND      0xFFU        /*!< No match found between Received SRC PDO and SNK capabilities                             */

/**
  * @}
  */

/* Private macro -------------------------------------------------------------*/
/** @defgroup USBPD_USER_PRIVATE_MACROS USBPD USER Private Macros
  * @{
  */
#if defined(_RTOS)
#define DPM_START_TIMER(_PORT_,_TIMER_,_TIMEOUT_)   do{                                                               \
                                                      DPM_Ports[_PORT_]._TIMER_ = (_TIMEOUT_) |  DPM_TIMER_ENABLE_MSK;\
                                                      osMessagePut(DPMMsgBox,DPM_USER_EVENT_TIMER, 0);                \
                                                    }while(0);
#else
#define DPM_START_TIMER(_PORT_, _TIMER_,_TIMEOUT_)  DPM_Ports[_PORT_]._TIMER_ = (_TIMEOUT_) |  DPM_TIMER_ENABLE_MSK;
#endif /* _RTOS */
#define IS_DPM_TIMER_RUNNING(_PORT_, _TIMER_)       ((DPM_Ports[_PORT_]._TIMER_ & DPM_TIMER_READ_MSK) > 0)
#define IS_DPM_TIMER_EXPIRED(_PORT_, _TIMER_)       (DPM_TIMER_ENABLE_MSK == DPM_Ports[_PORT_]._TIMER_)

/**
  * @}
  */

/* Private variables ---------------------------------------------------------*/
/** @defgroup USBPD_USER_PRIVATE_VARIABLES USBPD USER Private Variables
  * @{
  */
#if defined(_VDM) || defined(USBPD_BILLBOARD)
extern uint8_t VDM_Mode_On[USBPD_PORT_COUNT];
#endif /* _VDM || USBPD_BILLBOARD */
extern USBPD_ParamsTypeDef DPM_Params[USBPD_PORT_COUNT];
#if defined(USBPD_BILLBOARD)
extern USBD_HandleTypeDef hUsbDeviceBB[USBPD_PORT_COUNT];
#endif /* USBPD_BILLBOARD */
#if defined(USBPD_REV30_SUPPORT) && _ALERT && _PPS
extern USBPD_PWR_Port_PDO_Storage_TypeDef PWR_Port_PDO_Storage[USBPD_PORT_COUNT];
#endif /* USBPD_REV30_SUPPORT && _ALERT && _PPS */

/**
  * @}
  */

/* Private function prototypes -----------------------------------------------*/
/** @defgroup USBPD_USER_PRIVATE_FUNCTIONS USBPD USER Private Functions
  * @{
  */
#if defined(_SNK) || defined(_DRP)
static  void DPM_SNK_BuildRDOfromSelectedPDO(uint8_t PortNum, uint8_t IndexSrcPDO, USBPD_DPM_SNKPowerRequestDetails_TypeDef* PtrRequestPowerDetails,
                                             USBPD_SNKRDO_TypeDef* Rdo, USBPD_CORE_PDO_Type_TypeDef *PtrPowerObject);
static uint32_t DPM_FindVoltageIndex(uint32_t PortNum, USBPD_DPM_SNKPowerRequestDetails_TypeDef* PtrRequestPowerDetails);
#endif /*_SNK || _DRP */
#if defined(_SRC) || defined(_DRP)
static USBPD_StatusTypeDef DPM_TurnOnPower(uint8_t PortNum, USBPD_PortPowerRole_TypeDef Role);
static USBPD_StatusTypeDef DPM_TurnOffPower(uint8_t PortNum, USBPD_PortPowerRole_TypeDef Role);
static void                DPM_AssertRp(uint8_t PortNum);
#endif /* _SRC || _DRP */
#if defined(_DRP)
static void DPM_AssertRd(uint8_t PortNum);
#endif /* _DRP */
#if defined(_RTOS)
static uint32_t CheckDPMTimers(void);
#endif /* _RTOS */

#if defined(USBPD_REV30_SUPPORT)
#if _SRC_CAPA_EXT
static void DPM_ManageExtendedCapa(void);
#endif /* _SRC_CAPA_EXT */
#if _ALERT
static void DPM_ManageAlert(void);
#endif /* _ALERT */
#endif /* USBPD_REV30_SUPPORT */
#ifdef USBPD_BILLBOARD
static void DPM_USB_Billboard_START(void);
#endif /* USBPD_BILLBOARD */

/**
  * @}
  */

/* Exported functions ------- ------------------------------------------------*/
/** @defgroup USBPD_USER_EXPORTED_FUNCTIONS USBPD USER Exported Functions
  * @{
  */

