STMicroelectronics/STM32CubeG4/Projects/STM32G474E-EVAL/Demonstrations/Modules/ucpd/usbpd_dpm_user.c
/** @defgroup USBPD_USER_EXPORTED_FUNCTIONS_GROUP1 USBPD USER Exported Functions called by DPM CORE
  * @{
  */

/**
  * @brief  Initialize DPM (port power role, PWR_IF, CAD and PE Init procedures)
  * @retval USBPD Status
  */
USBPD_StatusTypeDef USBPD_DPM_UserInit(void)
{
  /* Demo initialisation */
  DEMO_InitBSP();

  /* PWR SET UP */
  if(USBPD_OK !=  USBPD_PWR_IF_Init())
  {
    return USBPD_ERROR;
  }

 /* VDM initialisation */
#ifdef _VDM
  if(USBPD_TRUE == DPM_Settings[USBPD_PORT_0].PE_VDMSupport)
  {
    if (USBPD_OK != USBPD_VDM_UserInit(USBPD_PORT_0))
    {
      return USBPD_ERROR;
    }
  }
#if USBPD_PORT_COUNT == 2
  if(USBPD_TRUE == DPM_Settings[USBPD_PORT_1].PE_VDMSupport)
  {
    if (USBPD_OK != USBPD_VDM_UserInit(USBPD_PORT_1))
    {
      return USBPD_ERROR;
    }
  }
#endif /* USBPD_PORT_COUNT == 2 */
#elif defined(_VCONN_SUPPORT)
  if (USBPD_OK != USBPD_VDM_UserInit(USBPD_PORT_0))
  {
    return USBPD_ERROR;
  }
#if USBPD_PORT_COUNT == 2
  if (USBPD_OK != USBPD_VDM_UserInit(USBPD_PORT_1))
  {
    return USBPD_ERROR;
  }
#endif /* USBPD_PORT_COUNT == 2 */
#endif /* _VDM */

#if defined(USBPD_TCPM_MODULE_ENABLED)
#else
  if(USBPD_OK != USBPD_PWR_IF_PowerResetGlobal()) return USBPD_ERROR;
#endif /* USBPD_TCPM_MODULE_ENABLED */

  DEMO_InitTask();

#if defined(_FWUPDATE_RESPONDER)||defined(_FWUPDATE_INITIATOR)
  USBPD_PDFU_UserInit(USBPD_PORT_0, &DPM_Params[USBPD_PORT_0]);
#endif /* _FWUPDATE_RESPONDER)|| _FWUPDATE_INITIATOR */
#ifdef _RTOS
  osMessageQDef(MsgBox, DPM_BOX_MESSAGES_MAX, uint32_t);
  DPMMsgBox = osMessageCreate(osMessageQ(MsgBox), NULL);
  osThreadDef(DPM, USBPD_DPM_UserExecute, osPriorityLow, 0, 300);

  if(NULL == osThreadCreate(osThread(DPM), &DPMMsgBox))
  {
    return USBPD_ERROR;
  }
#else
#endif /* _RTOS */

  return USBPD_OK;
}

/**
  * @brief  User delay implementation which is OS dependant
  * @param  Time time in ms
  * @retval None
  */
void USBPD_DPM_WaitForTime(uint32_t Time)
{
#ifndef _RTOS
  HAL_Delay(Time);
#else
  osDelay(Time);
#endif
}

/**
  * @brief  User processing time, it is recommended to avoid blocking task for long time
  * @param  argument pointer to task to execute
  * @retval None
  */
void USBPD_DPM_UserExecute(void const *argument)
{
  /* User code implementation */
#ifdef _RTOS
  uint32_t _timing = osWaitForever;
  osMessageQId  queue = *(osMessageQId *)argument;

  do
  {
    osEvent event = osMessageGet(queue, _timing);
    switch (((DPM_USER_EVENT)event.value.v & 0xF))
    {
#if defined(_GUI_INTERFACE)
    case DPM_USER_EVENT_GUI:
      {
        GUI_RXProcess((uint32_t)event.value.v);
        /* Sent an event to check if measurement report has been requested */
        osMessagePut(DPMMsgBox, DPM_USER_EVENT_TIMER, 0);
        break;
      }
#endif /* _GUI_INTERFACE */
    case DPM_USER_EVENT_TIMER:
      {
#endif /* _RTOS */
#if defined(_GUI_INTERFACE)
#ifndef _RTOS
        switch (GUI_Flag & 0xF)
        {
          case DPM_USER_EVENT_NONE:
            break;
          case DPM_USER_EVENT_GUI:
            GUI_RXProcess(GUI_Flag);
          case DPM_USER_EVENT_TIMER:
              break;
            default:
              break;
        }
        GUI_Flag = DPM_USER_EVENT_NONE;
#endif /* !_RTOS */
        for(uint8_t _instance = 0; _instance < USBPD_PORT_COUNT; _instance++)
        {
          /* -------------------------------------------------  */
          /* Check if timeout related to Measurement reporting  */
          /* -------------------------------------------------  */
          /* - Send a GUI Event only if PE is connected
          and Measurement report has been enabled          */
          if ((USBPD_TRUE == DPM_Params[_instance].PE_IsConnected)
              && (1 == GUI_USER_Params[_instance].u.d.MeasReportActivation)
                && (0 != GUI_USER_Params[_instance].u.d.MeasReportValue))
          {
            /* Check if timer has expired */
            if (IS_DPM_TIMER_EXPIRED(_instance, DPM_TimerMeasReport))
            {
              uint32_t event_mr = DPM_USER_EVENT_GUI | (_instance << GUI_PE_PORT_NUM_Pos) | (GUI_NOTIF_MEASUREMENT << GUI_PE_NOTIF_Pos);
              GUI_RXProcess(event_mr);
            }
            /* Start or Restart Measurement report timer */
            if (!(IS_DPM_TIMER_RUNNING(_instance, DPM_TimerMeasReport)))
            {
              DPM_START_TIMER(_instance, DPM_TimerMeasReport, (GUI_USER_Params[_instance].u.d.MeasReportValue * GUI_NOTIF_MEASUREMENT_STEP));
            }
          }
          else
          {
            /* Stop measurement report timer */
            DPM_Ports[_instance].DPM_TimerMeasReport = 0;
          }
        }
#endif /* _GUI_INTERFACE */

#ifdef USBPD_BILLBOARD
        DPM_USB_Billboard_START();

#endif /* USBPD_BILLBOARD */
#if defined(USBPD_REV30_SUPPORT)
#if _SRC_CAPA_EXT
        /* Manage the extended capa */
        DPM_ManageExtendedCapa();

#endif /* _SRC_CAPA_EXT */
#if _ALERT
        DPM_ManageAlert();

#endif /* _ALERT */
#endif /* USBPD_REV30_SUPPORT */
#ifdef _RTOS
        break;
      }

    default:
      break;
    }
    _timing = CheckDPMTimers();
  }
  while(1);
#else

#if defined(_FWUPDATE_RESPONDER)
  PDFU_Task(USBPD_PORT_0, PDFU_EVENT_NONE);
#endif /* _FWUPDATE_RESPONDER */
#endif /* _RTOS */
}

/**
  * @brief  function used to manage user timer.
  * @param  PortNum Port number
  * @retval None
  */
void USBPD_DPM_UserTimerCounter(uint8_t PortNum)
{
#ifdef USBPD_BILLBOARD
  if((DPM_Ports[PortNum].DPM_TimerAME & DPM_TIMER_READ_MSK) > 0)
  {
    DPM_Ports[PortNum].DPM_TimerAME--;
  }
#endif /* USBPD_BILLBOARD */
#ifdef USBPD_REV30_SUPPORT
#if _SRC_CAPA_EXT
  if((DPM_Ports[PortNum].DPM_TimerSRCExtendedCapa & DPM_TIMER_READ_MSK) > 0)
  {
    DPM_Ports[PortNum].DPM_TimerSRCExtendedCapa--;
  }
#endif /* _SRC_CAPA_EXT */
#if _ALERT
  if((DPM_Ports[PortNum].DPM_TimerAlert & DPM_TIMER_READ_MSK) > 0)
  {
    DPM_Ports[PortNum].DPM_TimerAlert--;
  }
#endif /* _ALERT */
#endif /* USBPD_REV30_SUPPORT */
#if defined(_GUI_INTERFACE)
  if((DPM_Ports[PortNum].DPM_TimerMeasReport & DPM_TIMER_READ_MSK) > 0)
  {
    DPM_Ports[PortNum].DPM_TimerMeasReport--;
  }
#endif /* _GUI_INTERFACE */
}

/**
  * @brief  UserCableDetection reporting events on a specified port from CAD layer.
  * @param  PortNum The handle of the port
  * @param  State   CAD state
  * @retval None
  */
void USBPD_DPM_UserCableDetection(uint8_t PortNum, USBPD_CAD_EVENT State)
{
  DEMO_PostCADMessage(PortNum, State, DPM_Params[PortNum].ActiveCCIs);

  switch(State)
  {
  case USBPD_CAD_EVENT_ATTACHED:
  case USBPD_CAD_EVENT_ATTEMC:
#if defined(_GUI_INTERFACE)
    GUI_FormatAndSendNotification(PortNum, GUI_NOTIF_ISCONNECTED, 0);
#endif /* _GUI_INTERFACE */

