STMicroelectronics/STM32CubeG4/Projects/STM32G474E-EVAL/Demonstrations/Modules/ucpd/usbpd_dpm_user.c
#ifdef _VDM
    USBPD_VDM_UserReset(PortNum);
#endif /* _VDM */
#if defined(_SRC) || defined(_DRP)
    if(USBPD_PORTPOWERROLE_SRC == DPM_Params[PortNum].PE_PowerRole)
    {
#if !defined(USBPD_TCPM_MODULE_ENABLED)
      USBPD_DPM_WaitForTime(110);
      if (USBPD_OK != USBPD_PWR_IF_VBUSEnable(PortNum))
      {
        /* display the error */
        DEMO_PostMMIMessage(DEMO_MMI_ACTION_ERROR);

        /* Should not occurr */
        USBPD_DPM_WaitForTime(6000);
        NVIC_SystemReset();
      }
#endif /* !USBPD_TCPM_MODULE_ENABLED*/
    }
#endif /* _SRC || _DRP */
    DPM_Ports[PortNum].DPM_IsConnected = 1;
    break;


  case USBPD_CAD_EVENT_DETACHED :
  case USBPD_CAD_EVENT_EMC :
  default :
    /* reset all values received from port partner */
    memset(&DPM_Ports[PortNum], 0, sizeof(DPM_Ports[PortNum]));
#if defined(_GUI_INTERFACE)
    GUI_FormatAndSendNotification(PortNum, GUI_NOTIF_ISCONNECTED | GUI_NOTIF_POWER_EVENT, 0);
#endif /* _GUI_INTERFACE */
#ifdef USBPD_BILLBOARD
    /* Stop tAMETimeout timer and stop Billboard */
    DPM_Ports[PortNum].DPM_TimerAME = 0;
    USBD_DeInit(&hUsbDeviceBB[PortNum]);
    USBD_Init(&hUsbDeviceBB[PortNum], &BB_Desc, 0);
    USBD_RegisterClass(&hUsbDeviceBB[PortNum], &USBD_BB);

#endif /* USBPD_BILLBOARD */
#ifdef _VDM
    USBPD_VDM_UserReset(PortNum);
#endif /* _VDM */
#if defined(USBPD_TCPM_MODULE_ENABLED)
#else
#if defined(_SRC) || defined(_DRP)
    if(USBPD_PORTPOWERROLE_SRC == DPM_Params[PortNum].PE_PowerRole)
    {
      if (USBPD_OK != USBPD_PWR_IF_VBUSDisable(PortNum))
      {
        /* Should not occurr */
        while(1);
      }
    }
#endif /* _SRC || _DRP */
#endif /* !USBPD_TCPM_MODULE_ENABLED*/

#if defined(_VCONN_SUPPORT)
    if(USBPD_TRUE == DPM_Params[PortNum].VconnStatus)
    {
      /* Switch Off Vconn */
      USBPD_DPM_PE_VconnPwr(PortNum, USBPD_DISABLE);
    }
#endif /* _VCONN_SUPPORT */
#if defined(_FWUPDATE_INITIATOR)||defined(_FWUPDATE_RESPONDER)
#if defined(_FWUPDATE_INITIATOR)
    /* Kill the PDFU task*/
    USBPD_PDFU_INIT_TerminateTask(PortNum);
#endif /* _FWUPDATE_INITIATOR */
#if defined(_FWUPDATE_RESPONDER)
    /* Kill the PDFU task*/
    USBPD_PDFU_TerminateTask(PortNum);
#endif /* _FWUPDATE_RESPONDER */
#endif /* _FWUPDATE_INITIATOR || _FWUPDATE_RESPONDER */
    break;
  }
}

/**
  * @}
  */

/** @defgroup USBPD_USER_EXPORTED_FUNCTIONS_GROUP2 USBPD USER Exported Callbacks functions called by PE
  * @{
  */

/**
  * @brief  Callback function called by PE layer when HardReset message received from PRL
  * @param  PortNum     The current port number
  * @param  CurrentRole the current role
  * @param  Status      status on hard reset event
  * @retval None
  */
void USBPD_DPM_HardReset(uint8_t PortNum, USBPD_PortPowerRole_TypeDef CurrentRole, USBPD_HR_Status_TypeDef Status)
{
#ifdef _VDM
  USBPD_VDM_UserReset(PortNum);
#endif /* _VDM */
#if defined(USBPD_REV30_SUPPORT) && _ALERT
  /* Stop Alert timer */
  DPM_Ports[PortNum].DPM_TimerAlert    = 0;
  DPM_Ports[PortNum].DPM_SendAlert.d32 = 0;
#endif /* USBPD_REV30_SUPPORT && _ALERT */

  switch (Status)
  {
#if defined(_SRC) || defined(_DRP)
  case USBPD_HR_STATUS_START_ACK:
  case USBPD_HR_STATUS_START_REQ:
    if (USBPD_PORTPOWERROLE_SRC == CurrentRole)
    {
      /* Reset the power supply */
      DPM_TurnOffPower(PortNum, USBPD_PORTPOWERROLE_SRC);
    }
    else
    {
      USBPD_PWR_IF_VBUSIsEnabled(PortNum);
    }
    break;
  case USBPD_HR_STATUS_COMPLETED:
    /* Reset the power supply */
    DPM_TurnOnPower(PortNum,CurrentRole);
    break;
#endif /* _SRC || _DRP */
  default:
      break;
  }
}

#if defined(_SRC) || defined(_DRP)
/**
  * @brief  Request the DPM to setup the new power level.
  * @param  PortNum The current port number
  * @retval USBPD status
  */
USBPD_StatusTypeDef USBPD_DPM_SetupNewPower(uint8_t PortNum)
{
  return  USBPD_PWR_IF_SetProfile(PortNum);
}

#endif /* _SRC || _DRP */
/**
  * @brief  Evaluate the swap request from PE.
  * @param  PortNum The current port number
  * @retval USBPD_ACCEPT, USBPD_WAIT, USBPD_REJECT
  */
USBPD_StatusTypeDef USBPD_DPM_EvaluatePowerRoleSwap(uint8_t PortNum)
{
  return USBPD_ACCEPT;
}

/**
  * @brief  Callback function called by PE to inform DPM about PE event.
  * @param  PortNum The current port number
  * @param  EventVal @ref USBPD_NotifyEventValue_TypeDef
  * @retval None
  */
void USBPD_DPM_Notification(uint8_t PortNum, USBPD_NotifyEventValue_TypeDef EventVal)
{
  DEMO_PostNotificationMessage(PortNum, EventVal);

  switch(EventVal)
  {
    /***************************************************************************
                              Power Notification
    */
    case USBPD_NOTIFY_POWER_EXPLICIT_CONTRACT :
      /* Power ready means an explicit contract has been establish and Power is available */
#if defined(USBPD_REV30_SUPPORT)
#if _ALERT
#if defined(_SRC) || defined(_DRP)
      if ((USBPD_SPECIFICATION_REV3 == DPM_Params[PortNum].PE_SpecRevision)
       && (USBPD_PORTPOWERROLE_SRC == DPM_Params[PortNum].PE_PowerRole))
      {
        DPM_START_TIMER(PortNum, DPM_TimerAlert, DPM_TIMER_ALERT);
      }
#endif /* _SRC || _DRP */
#endif /* _ALERT */
#if defined(_FWUPDATE_INITIATOR)||defined(_FWUPDATE_RESPONDER)
#if defined(_FWUPDATE_INITIATOR)
    /* Start the PDFU initiator task*/
    USBPD_PDFU_INIT_CreateTask(PortNum);
#endif /* _FWUPDATE_INITIATOR */
#if defined(_FWUPDATE_RESPONDER)
    /* Start the PDFU Responder task*/
    USBPD_PDFU_CreateTask(PortNum);
    /* Send an UVDM message to indicate initiator that CC loader is ready */
    USBPD_DPM_RequestUVDMMessage(PortNum, USBPD_SOPTYPE_SOP);
#endif /* _FWUPDATE_RESPONDER */
#endif /* _FWUPDATE_INITIATOR || _FWUPDATE_RESPONDER */
#endif /* USBPD_REV30_SUPPORT */
    break;
    /*
                              End Power Notification
     ***************************************************************************/
#if defined(_SNK) || defined(_DRP)
    /***************************************************************************
                               REQUEST ANSWER NOTIFICATION
    */
    case USBPD_NOTIFY_REQUEST_ACCEPTED:
      /* Update DPM_RDOPosition only if current role is SNK */
      if (USBPD_PORTPOWERROLE_SNK == DPM_Params[PortNum].PE_PowerRole)
      {
        USBPD_SNKRDO_TypeDef rdo;
        rdo.d32                                   = DPM_Ports[PortNum].DPM_RequestDOMsg;
        DPM_Ports[PortNum].DPM_RDOPosition        = rdo.GenericRDO.ObjectPosition;
#if defined(_GUI_INTERFACE)
        DPM_USER_Settings[PortNum].DPM_SNKRequestedPower.OperatingVoltageInmVunits    = DPM_Ports[PortNum].DPM_RequestedVoltage;
        DPM_USER_Settings[PortNum].DPM_SNKRequestedPower.OperatingPowerInmWunits      = (DPM_Ports[PortNum].DPM_RequestedVoltage * DPM_USER_Settings[PortNum].DPM_SNKRequestedPower.MaxOperatingCurrentInmAunits) / 1000;
#endif /* _GUI_INTERFACE */
      }
    break;
    /*
                              End REQUEST ANSWER NOTIFICATION
     ***************************************************************************/
#endif /* _SNK || _DRP */
#if defined(_VDM) || defined(_FWUPDATE_INITIATOR)
    case USBPD_NOTIFY_HARDRESET_RX:
    case USBPD_NOTIFY_HARDRESET_TX:
#if defined(_VDM)
      if (USBPD_PORTPOWERROLE_SNK == DPM_Params[PortNum].PE_PowerRole)
      {
          USBPD_VDM_UserReset(PortNum);
      }
#endif /* _VDM */
#if defined(_FWUPDATE_INITIATOR)
      USBPD_PDFU_INIT_TerminateTask(PortNum);
#endif /* _FWUPDATE_INITIATOR */
#if defined(_FWUPDATE_RESPONDER)
      /* Kill the PDFU task*/
      USBPD_PDFU_TerminateTask(PortNum);
#endif /* _FWUPDATE_RESPONDER */
      break;
#endif /* _VDM || _FWUPDATE_INITIATOR */
#if defined(_SNK) || defined(_DRP)
    case USBPD_NOTIFY_STATE_SNK_READY:
      {
#if defined(USBPD_REV30_SUPPORT)
#if _SRC_CAPA_EXT
        /* Send GET_SRC_CAPA_EXT only if current revision is PD3.0 */
        if ((USBPD_SPECIFICATION_REV3 == DPM_Params[PortNum].PE_SpecRevision)
         && (1 == DPM_Ports[PortNum].FlagSendGetSrcCapaExtended))
        {
          DPM_START_TIMER(PortNum, DPM_TimerSRCExtendedCapa, DPM_TIMER_GET_SRC_CAPA_EXT);
          DPM_Ports[PortNum].FlagSendGetSrcCapaExtended = 0;
        }
#endif /* _SRC_CAPA_EXT*/
#endif /* USBPD_REV30_SUPPORT */
      }
      break;

#endif /* _SNK || _DRP */
    case USBPD_NOTIFY_STATE_SRC_DISABLED:
      {
        /* SINK Port Partner is not PD capable. Legacy cable may have been connected
           In this state, VBUS is set to 5V */
      }
      break;
    default :
      break;
  }

#if defined(_GUI_INTERFACE)
  GUI_PostNotificationMessage(PortNum, EventVal);
#endif /* _GUI_INTERFACE */
}

/**
  * @brief  DPM callback to allow PE to retrieve information from DPM/PWR_IF.
  * @param  PortNum Port number
  * @param  DataId  Type of data to be updated in DPM based on @ref USBPD_CORE_DataInfoType_TypeDef
  * @param  Ptr     Pointer on address where DPM data should be written (u8 pointer)
  * @param  Size    Pointer on nb of u8 written by DPM
  * @retval None
  */
void USBPD_DPM_GetDataInfo(uint8_t PortNum, USBPD_CORE_DataInfoType_TypeDef DataId, uint8_t *Ptr, uint32_t *Size)
{
  /* Check type of information targeted by request */
  switch (DataId)
  {
    /* Case Port Source PDO Data information :
    Case Port SINK PDO Data information :
    Call PWR_IF PDO reading request.
    */
  case USBPD_CORE_DATATYPE_SRC_PDO :
  case USBPD_CORE_DATATYPE_SNK_PDO :
    USBPD_PWR_IF_GetPortPDOs(PortNum, DataId, Ptr, Size);
    *Size *= 4;
    break;

    /* Case Requested voltage value Data information */
  case USBPD_CORE_DATATYPE_REQ_VOLTAGE :
    *Size = 4;
    (void)memcpy((uint8_t*)Ptr, (uint8_t *)&DPM_Ports[PortNum].DPM_RequestedVoltage, *Size);
    break;

#if defined(USBPD_REV30_SUPPORT)
#if _PPS
  case USBPD_CORE_PPS_STATUS :
    {
      /* Get current drawn by sink */
      USBPD_PPSSDB_TypeDef pps_status = {0};

      /* Disable VBUS & IBUS Measurements */
      pps_status.fields.OutputVoltageIn20mVunits  = 0xFFFF;
      pps_status.fields.OutputCurrentIn50mAunits  = 0xFF;
      pps_status.fields.RealTimeFlags             = USBPD_PPS_REALTIMEFLAGS_PTF_NOT_SUPPORTED | USBPD_PPS_REALTIMEFLAGS_OMF_DISABLED;

      *Size = 4;
      (void)memcpy((uint8_t*)Ptr, (uint8_t *)&pps_status.d32, *Size);
    }
    break;
#endif /* _PPS */
#if _SRC_CAPA_EXT && (defined(_SRC)||defined(_DRP))
  case USBPD_CORE_EXTENDED_CAPA :
    {
      *Size = sizeof(USBPD_SCEDB_TypeDef);
      memcpy((uint8_t*)Ptr, (uint8_t *)&DPM_USER_Settings[PortNum].DPM_SRCExtendedCapa, *Size);
    }
    break;
#endif /* _SRC_CAPA_EXT && (_SRC || _DRP) */
#if _STATUS
  case USBPD_CORE_INFO_STATUS :
    {
      USBPD_SDB_TypeDef  infostatus = {
        .InternalTemp = 0,          /*!< Source or Sink internal temperature in degrees centigrade */
        .PresentInput = 0,          /*!< Present Input                                             */
        .PresentBatteryInput = 0,   /*!< Present Battery Input                                     */
        .EventFlags = 0,            /*!< Event Flags                                               */
        .TemperatureStatus = 0,     /*!< Temperature                                               */
        .PowerStatus = 0,           /*!< Power Status based on combination of @ref USBPD_SDB_POWER_STATUS*/
      };

      *Size = sizeof(USBPD_SDB_TypeDef);
      memcpy((uint8_t *)Ptr, &infostatus, *Size);
    }
    break;
#endif /* _STATUS */
#if _MANU_INFO
  case USBPD_CORE_MANUFACTURER_INFO :
    {
      USBPD_MIDB_TypeDef* manu_info;
      /* Manufacturer Info Target must be a range 0..1 */
      /* Manufacturer Info Ref must be a range 0..7    */
      if((DPM_Ports[PortNum].DPM_GetManufacturerInfo.ManufacturerInfoTarget > USBPD_MANUFINFO_TARGET_BATTERY)
      || (DPM_Ports[PortNum].DPM_GetManufacturerInfo.ManufacturerInfoRef > USBPD_MANUFINFO_REF_MAX_VALUES))
      {
        /* If the Manufacturer Info Target field or Manufacturer Info Ref field in the Get_Manufacturer_Info Message is
           unrecognized the field Shall return a null terminated ascii text string Not Supported.*/
        char *_notsupported = "Not Supported\0";
        *Size = 4 + 14; /* VID (2) + .PID(2) + sizeof("Not Supported\0")*/
        /* Copy Manufacturer Info into data area for transmission */
        manu_info = (USBPD_MIDB_TypeDef*)&DPM_USER_Settings[PortNum].DPM_ManuInfoPort;
        memcpy((uint8_t*)Ptr, (uint8_t *)manu_info, 4);
        memcpy((uint8_t*)(Ptr + 4), (uint8_t *)_notsupported, 14);
      }
      else
      {
        if (USBPD_MANUFINFO_TARGET_PORT_CABLE_PLUG == DPM_Ports[PortNum].DPM_GetManufacturerInfo.ManufacturerInfoTarget)
        {
          /* Manufacturer info requested for the port */
          /* VID(2) + .PID(2) + .ManuString("STMicroelectronics") */
          *Size = 4 + strlen((char*)(DPM_USER_Settings[PortNum].DPM_ManuInfoPort.ManuString));
          /* Copy Manufacturer Info into data area for transmission */
          manu_info = (USBPD_MIDB_TypeDef*)&DPM_USER_Settings[PortNum].DPM_ManuInfoPort;
          memcpy((uint8_t*)Ptr, (uint8_t *)manu_info, *Size);
        }
        else
        {
          /* Manufacturer info requested for the battery (not available yet) */
          /* If the Manufacturer Info Target field or Manufacturer Info Ref field in the Get_Manufacturer_Info Message is
             unrecognized the field Shall return a null terminated ascii text string Not Supported.*/
          char *_notsupported = "Not Supported\0";
          *Size = 4 + 14; /* VID (2) + .PID(2) + sizeof("Not Supported\0")*/
          /* Copy Manufacturer Info into data area for transmission */
          manu_info = (USBPD_MIDB_TypeDef*)&DPM_USER_Settings[PortNum].DPM_ManuInfoPort;
          memcpy((uint8_t*)Ptr, (uint8_t *)manu_info, 4);
          memcpy((uint8_t*)(Ptr + 4), (uint8_t *)_notsupported, 14);
        }
      }
    }
    break;
#endif /* _MANU_INFO */
#if _BATTERY
  case USBPD_CORE_BATTERY_STATUS:
    {
      USBPD_BSDO_TypeDef  battery_status;

