STMicroelectronics/STM32CubeG4/Projects/STM32G474E-EVAL/Demonstrations/Modules/ucpd/usbpd_dpm_user.c
      battery_status.d32 = 0;
#if _SRC_CAPA_EXT && (defined(_SRC)||defined(_DRP))
      if ((DPM_Ports[PortNum].DPM_GetBatteryStatus.BatteryStatusRef < 8)
        && (DPM_Ports[PortNum].DPM_GetBatteryStatus.BatteryStatusRef < DPM_USER_Settings[PortNum].DPM_SRCExtendedCapa.NbBatteries))
      {
        battery_status.b.BatteryPC    = 0xABCDu;
        battery_status.b.BatteryInfo  = USBPD_BSDO_BATT_INFO_BATT_PRESENT | USBPD_BSDO_BATT_INFO_BATT_ISIDLE;
      }
      else
#endif /* _SRC_CAPA_EXT && (_SRC || _DRP) */
      {
        battery_status.b.BatteryPC    = 0xFFFFu;
        battery_status.b.BatteryInfo  = USBPD_BSDO_BATT_INFO_INVALID_REF;
      }
      *Size = 4;
      memcpy((uint8_t *)Ptr, (uint8_t *)&battery_status.d32, *Size);
    }
    break;

  case USBPD_CORE_BATTERY_CAPABILITY:
    {
#if _SRC_CAPA_EXT && (defined(_SRC)||defined(_DRP))
      if (0 != DPM_USER_Settings[PortNum].DPM_SRCExtendedCapa.NbBatteries)
      {
        *Size = sizeof(USBPD_BCDB_TypeDef);
        USBPD_BCDB_TypeDef  battery_capability = {
          .VID = USBPD_VID,                     /*!< Vendor ID (assigned by the USB-IF)         */
          .PID = USBPD_PID,                     /*!< Product ID (assigned by the manufacturer)  */
          .BatteryDesignCapa = 0xAABB,          /*!< Battery Design Capacity                    */
          .BatteryLastFullChargeCapa = 0xCCDD,  /*!< Battery last full charge capacity          */
          .BatteryType= 0,                      /*!< Battery Type                               */
        };
        if (DPM_Ports[PortNum].DPM_GetBatteryCapability.BatteryCapRef >= 8)
        {
          battery_capability.BatteryType  = 1;
        }

        memcpy((uint8_t *)Ptr, &battery_capability, *Size);
      }
      else
#endif /* _SRC_CAPA_EXT && (_SRC || _DRP) */
      {
        /* Set Size to 0 to send a not supported message */
        *Size = 0;
      }
    }
    break;
#endif /* _BATTERY */
#if _ALERT
  case USBPD_CORE_ALERT:
    {
#if _BATTERY
      uint32_t index = 0;
      /*!< Battery Status Change Event(Attach/Detach/charging/discharging/idle) */
      if (USBPD_ADO_TYPE_ALERT_BATTERY_STATUS == (DPM_Ports[PortNum].DPM_RcvAlert.b.TypeAlert & USBPD_ADO_TYPE_ALERT_BATTERY_STATUS))
      {
        USBPD_GBSDB_TypeDef get_battery_status;
        uint32_t battery_found = 0;

        /* Set default value for BatteryStatusRef
           (useful when no battery selected Fixed Batteries or Hot Swappable Batteries fields in ALERT message
            as in MQP implementation of Test PROT-SRC3-STATUS */
        get_battery_status.BatteryStatusRef = 0;

        for (index = 0; index < 4; index++)
        {
          if ((1 << index) == (DPM_Ports[PortNum].DPM_RcvAlert.b.FixedBatteries & (1 << index)))
          {
            get_battery_status.BatteryStatusRef = index;
            battery_found = 1;
            break;
          }
        }
        if (!battery_found)
        {
          for (index = 0; index < 4; index++)
          {
            if ((1 << index) == (DPM_Ports[PortNum].DPM_RcvAlert.b.HotSwappableBatteries & (1 << index)))
            {
              get_battery_status.BatteryStatusRef = index + 4;
              battery_found = 1;
              break;
            }
          }
        }

        /* Post a GET_BATTERY_STATUS message to PE */
        USBPD_DPM_RequestGetBatteryStatus(PortNum, (uint8_t*)&get_battery_status);

        /* Reset Battery Status bit */
        DPM_Ports[PortNum].DPM_RcvAlert.b.TypeAlert &= ~USBPD_ADO_TYPE_ALERT_BATTERY_STATUS;
        break;
      }
#endif /* _BATTERY */
      /*!< Over-Current Protection event when set (Source only, for Sink Reserved and Shall be set to zero) */
      /* Bit reserved for a Sink */
      if ((USBPD_PORTPOWERROLE_SNK == DPM_Params[PortNum].PE_PowerRole)
               && (USBPD_ADO_TYPE_ALERT_OCP == (DPM_Ports[PortNum].DPM_RcvAlert.b.TypeAlert & USBPD_ADO_TYPE_ALERT_OCP)))
      {
        /* Reset OCP bit */
        DPM_Ports[PortNum].DPM_RcvAlert.b.TypeAlert &= ~USBPD_ADO_TYPE_ALERT_OCP;
        /* Send a Get_Status */
        goto _ctrl_msg;
      }
      /*!< Over-Temperature Protection event when set. */
      else if (USBPD_ADO_TYPE_ALERT_OTP == (DPM_Ports[PortNum].DPM_RcvAlert.b.TypeAlert & USBPD_ADO_TYPE_ALERT_OTP))
      {
        /* Reset OTP bit */
        DPM_Ports[PortNum].DPM_RcvAlert.b.TypeAlert &= ~USBPD_ADO_TYPE_ALERT_OTP;
        /* Send a Get_Status */
        goto _ctrl_msg;
      }
      /*!< Operating Condition Change when set */
      else if (USBPD_ADO_TYPE_ALERT_OPERATING_COND == (DPM_Ports[PortNum].DPM_RcvAlert.b.TypeAlert & USBPD_ADO_TYPE_ALERT_OPERATING_COND))
      {
        /* Reset OP COND bit */
        DPM_Ports[PortNum].DPM_RcvAlert.b.TypeAlert &= ~USBPD_ADO_TYPE_ALERT_OPERATING_COND;
        /* Send a Get_Status */
        goto _ctrl_msg;
      }
      /*!< Source Input Change Event when set */
      else if (USBPD_ADO_TYPE_ALERT_SRC_INPUT == (DPM_Ports[PortNum].DPM_RcvAlert.b.TypeAlert & USBPD_ADO_TYPE_ALERT_SRC_INPUT))
      {
        /* Reset SRC input bit */
        DPM_Ports[PortNum].DPM_RcvAlert.b.TypeAlert &= ~USBPD_ADO_TYPE_ALERT_SRC_INPUT;
        /* Send a Get_Status */
        goto _ctrl_msg;
      }
      /*!< Over-Voltage Protection event when set (Sink only, for Source Reserved and Shall be set to zero) */
      /* Bit reserved for a Source */
      else
      {
#if defined(_SRC) || defined(_DRP)
        if ((USBPD_PORTPOWERROLE_SRC == DPM_Params[PortNum].PE_PowerRole)
               && (USBPD_ADO_TYPE_ALERT_OVP == (DPM_Ports[PortNum].DPM_RcvAlert.b.TypeAlert & USBPD_ADO_TYPE_ALERT_OVP)))
        {
          /* Reset OVP bit */
          DPM_Ports[PortNum].DPM_RcvAlert.b.TypeAlert &= ~USBPD_ADO_TYPE_ALERT_OVP;
          /* Send a Get_Status */
          goto _ctrl_msg;
        }
#endif /* _SRC || _DRP */
      }

_ctrl_msg:
      /* Post GET_STATUS message */
      USBPD_DPM_RequestGetStatus(PortNum);
    }
    break;
#endif /* ALERT */
#endif /* USBPD_REV30_SUPPORT */
  default :
    *Size = 0;
    break;
  }
}

/**
  * @brief  DPM callback to allow PE to update information in DPM/PWR_IF.
  * @param  PortNum Port number
  * @param  DataId  Type of data to be updated in DPM based on @ref USBPD_CORE_DataInfoType_TypeDef
  * @param  Ptr     Pointer on address where DPM data should be written (u8 pointer)
  * @param  Size    Nb of bytes to be updated in DPM
  * @retval None
  */
void USBPD_DPM_SetDataInfo(uint8_t PortNum, USBPD_CORE_DataInfoType_TypeDef DataId, uint8_t *Ptr, uint32_t Size)
{
  uint32_t index;

